Revit 2027 API
MultiReferenceAnnotationType.IsAllowedTagType Method
 Checks if the tag type can be assigned to this multi-reference annotation type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAllowedTagType(
	ElementId tagTypeId
)
Public Function IsAllowedTagType (
	tagTypeId As ElementId
) As Boolean
public:
bool IsAllowedTagType(
	ElementId^ tagTypeId
)
member IsAllowedTagType :
        tagTypeId : ElementId -> bool
Parameters
tagTypeId ElementId
 The tag type to test.
Return Value
Boolean
 True if the tag type exclusively tags elements from the multi-reference annotation's reference category.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only tag types which exclusively tag elements from the multi-reference annotation's reference category can be used.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace